Revit 2022 API
Connector.Coefficient Property
The coefficient of the connector.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 22.0.0.0 (22.1.0.0)
Syntax
C#
public double Coefficient { get; }
Visual Basic
Public ReadOnly Property Coefficient As Double
	Get
Visual C++
public:
property double Coefficient {
	double get ();
}
Remarks
Instantaneous coefficient of this connector, calculated according to system.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.InvalidOperationException |  Thrown when the connector's domain is not DomainHvac or DomainPiping.
See Also
Connector Class
Autodesk.Revit.DB Namespace